# Cleaning Data in Pandas DataFrames

## 1. Import libraries and dependencies

In [8]:
# Import the pandas and pathlib libraries
import pandas as pd
from pathlib import Path
import matplotlib as plt

## 2. Create a Path to the File Using Pathlib

In [9]:
# Use the Pathlib libary to set the path to the CSV
filepath=Path('../Resources/people_reordered.csv')
df=pd.read_csv(filepath)

## 3. Read the CSV into a Pandas DataFrame

In [10]:
# Use the file path to read the CSV into a DataFrame and display a few rows
df.tail()

,Unnamed: 0,Person_ID,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age
995,995,996.0,Crumpton,Meta,Female,ECAM - Institut Supérieur Industriel,Registered Nurse,57060.0,mcrumptonrn@qq.com,52
996,996,997.0,Gilford,Gunar,Male,Smolny University,Marketing Manager,76109.0,ggilfordro@yandex.ru,32
997,997,998.0,Gurling,Lucretia,Female,Institut Teknologi Telkom,Software Engineer III,92115.0,lgurlingrp@de.vu,48
998,998,999.0,Yang,Andrew,Male,Rutgers University School of Business,Curriculum Engineer,60000.0,ayang@codedrills.com,53
999,999,999.0,Yang,Andrew,Male,Rutgers University School of Business,Curriculum Engineer,60000.0,ayang@codedrills.com,53

## 4. View Column Data Types

In [11]:
# Use the `dtypes` attribute to list the column data types
df.dtypes

Unnamed: 0      int64
Person_ID     float64
Last_Name      object
First_Name     object
Gender         object
University     object
Occupation     object
Salary        float64
Email          object
Age             int64
dtype: object

## 5. Drop Extraneous Columns

In [12]:
# Use the `drop` function to drop specific columns
dfclean=df.drop(columns=['Person_ID','Unnamed: 0'])
dfclean.head()

,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age
0,Lenormand,Keriann,Female,Aurora University,Nurse Practicioner,58135.0,klenormand0@businessinsider.com,27
1,Rupke,Huntley,Male,Osaka University of Economics,Project Manager,96053.0,hrupke1@reuters.com,22
2,Dalgarnowch,Gorden,Male,Ludong University,Environmental Tech,59196.0,gdalgarnowch2@microsoft.com,40
3,NaN,Cullie,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0,cputten3@nymag.com,62
4,Strangman,Ariel,Female,Boise State University,Project Manager,89073.0,astrangman4@bravesites.com,47

---

## 6. Identify Data Quality Issues

### 1. Identify the Number of Rows

In [13]:
# Use the `count` function to view count of non-null values for each column
dfclean.isnull().sum()

Last_Name     10
First_Name     7
Gender         2
University     9
Occupation     2
Salary         2
Email          8
Age            0
dtype: int64

### 2. Identify Frequency Counts of a Specific Column

In [14]:
# Identifying frequency counts of the `first_name` column
dfclean['First_Name'].value_counts()

Ailbert    3
Israel     3
Marty      2
Ruy        2
Gal        2
          ..
Cirillo    1
Bradan     1
Lucho      1
Audry      1
Jeniece    1
Name: First_Name, Length: 914, dtype: int64

### 3. Identify Null Values

In [15]:
# Checking for null
dfclean.isnull()

,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,True,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

### 4. Determine the Number of Nulls

In [16]:
# Determining number of nulls
dfclean.isnull()
dfclean.isnull().sum()
dfclean.isnull().sum().sum()

40

### 5. Determining the Percentage of Nulls for each Column

In [17]:
# Determining percentage of nulls
dfclean.isnull().mean()*100

Last_Name     1.0
First_Name    0.7
Gender        0.2
University    0.9
Occupation    0.2
Salary        0.2
Email         0.8
Age           0.0
dtype: float64

### 6. Check for Duplicate Rows

In [18]:
# Use the `duplicated` function to determine the existance of duplicate rows: True or False
dfclean.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999     True
Length: 1000, dtype: bool

### 7. Check for Duplicate `first_name` Values

In [19]:
# Use the `duplicated` function in conjunction with a list of columns to 
# determine the existence of duplicate rows based on the selected columns
dfclean[['First_Name','Last_Name']].duplicated
dfclean['First_Name']=dfclean['First_Name'].fillna('No_Name')
dfclean.dropna(inplace=True)
dfclean.isnull().sum().sum()

0

---

## 7. Resolve Data Quality Issues

### 1. Fill First_Name and Last_Name Null Values with Default Value "Unnamed"

### 2. Drop Remaining Records with Nulls from DataFrame

### 3. Check Null Counts for Each Column (Again)

### 4. Cleanse data by Dropping Duplicates

In [21]:
# Use the `drop_duplicates` function with the `subset` parameter to 
# drop duplicates based on a selection of columns
dfclean.drop_duplicates(subset=['Last_Name','First_Name'])

,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age
0,Lenormand,Keriann,Female,Aurora University,Nurse Practicioner,58135.0,klenormand0@businessinsider.com,27
1,Rupke,Huntley,Male,Osaka University of Economics,Project Manager,96053.0,hrupke1@reuters.com,22
2,Dalgarnowch,Gorden,Male,Ludong University,Environmental Tech,59196.0,gdalgarnowch2@microsoft.com,40
4,Strangman,Ariel,Female,Boise State University,Project Manager,89073.0,astrangman4@bravesites.com,47
5,Snozzwell,Antonio,Male,Babcock University,Technical Writer,119916.0,asnozzwell5@mysql.com,49
...,...,...,...,...,...,...,...,...
994,Jeacop,Iggy,Male,University of Greenwich,Sales Associate,82726.0,ijeacoprm@4shared.com,22
995,Crumpton,Meta,Female,ECAM - Institut Supérieur Industriel,Registered Nurse,57060.0,mcrumptonrn@qq.com,52
996,Gilford,Gunar,Male,Smolny University,Marketing Manager,76109.0,ggilfordro@yandex.ru,32
997,Gurling,Lucretia,Female,Institut Teknologi Telkom,Software Engineer III,92115.0,lgurlingrp@de.vu,48
998,Yang,Andrew,Male,Rutgers University School of Business,Curriculum Engineer,60000.0,ayang@codedrills.com,53

### 5. Convert Columns to Different DataTypes

In [22]:
# Use the `as_type` function to convert `Person_ID` from `float` to `int`
#* I HAVE ALREADY REMOVED PERSON_ID from DATA FRAME
dfclean['Person_ID']=dfclean['Person_ID'].astype('int')

KeyError: 'Person_ID'

## 8. Save Cleansed Data to New CSV

In [48]:
# Save modified DataFrame to the Resources folder. 
# Use the `index` parameter set to `False` to exclude saving the index.
dfclean.to_csv('../Unsolved/dfclean.csv',index=False)